class script(object):
    START_TXT = """𝙃𝙚𝙡𝙡𝙤 {},
𝙄 𝙖𝙢 𝙕𝙞𝙖𝙣𝙣𝙖,
𝙄 𝙘𝙖𝙣 𝙝𝙚𝙡𝙥 𝙮𝙤𝙪 𝙩𝙤 𝙙𝙤𝙬𝙣𝙡𝙤𝙖𝙙 𝙨𝙞𝙣𝙝𝙖𝙡𝙖 𝙨𝙪𝙗𝙩𝙞𝙩𝙡𝙚𝙨 𝙛𝙤𝙧 𝙢𝙤𝙫𝙞𝙚𝙨 𝙖𝙣𝙙 𝙩𝙫 𝙨𝙚𝙧𝙞𝙚𝙨. 𝙄𝙩'𝙨 𝙩𝙤𝙤 𝙚𝙖𝙨𝙮. 𝙔𝙤𝙪 𝙘𝙖𝙣 𝙧𝙚𝙖𝙙 𝙝𝙚𝙡𝙥 𝙣𝙤𝙩𝙚 𝙩𝙤 𝙠𝙣𝙤𝙬 𝙝𝙤𝙬 𝙩𝙤 𝙪𝙨𝙚 𝙢𝙚.

⚠️𝘿𝙄𝙎𝘾𝙇𝘼𝙄𝙈𝙀𝙍⚠️ 
𝘼𝙡𝙡 𝙩𝙝𝙚 𝙛𝙞𝙡𝙚𝙨 𝙖𝙧𝙚 𝙪𝙥𝙡𝙤𝙖𝙙𝙚𝙙 𝙛𝙧𝙤𝙢 𝙬𝙚𝙗𝙨𝙞𝙩𝙚𝙨 𝙡𝙞𝙠𝙚 <a href=https://www.baiscopelk.com>𝘽𝙖𝙞𝙨𝙘𝙤𝙥𝙚𝙡𝙠</a> , <a href=https://cineru.lk>𝘾𝙞𝙣𝙚𝙧𝙪</a> , <a href=https://zoom.lk>𝙯𝙤𝙤𝙢</a> , <a href=https://piratelk.com>𝙋𝙞𝙧𝙖𝙩𝙚𝙡𝙠</a>.  𝙈𝙤𝙨𝙩 𝙤𝙛 𝙩𝙝𝙚 𝙛𝙞𝙡𝙚𝙨 𝙝𝙖𝙫𝙚 𝙘𝙤𝙥𝙮𝙧𝙞𝙜𝙝𝙩𝙨 𝙩𝙤 𝙩𝙝𝙚 𝙤𝙬𝙣𝙚𝙧𝙨.

<a href=https://t.me/slofficialmain> ‌‌‌‌©ꜱʟ ᴏꜰꜰɪᴄɪᴀʟ ­</a> ­ """
    HELP_TXT = """<b>❇️පහල ඇති button යොදාගෙන ඔබට උපකාර අවශ්‍ය section තෝරන්න.</b>"""
    ABOUT_TXT = """♣️ 𝐀𝐛𝐨𝐮𝐭 𝐔𝐬 ♣️
<b>
❇️ පිස්සෝ ටිකක් බං එච්චරයි. ආතල් එකට වගේ කරන වැඩක්. අපිට මේකෙන් කිසි දෙයක් හම්බ වෙන්නෙත් නැ. හිතේ සතුට විතරයි. අපේ සතුට වැඩිවෙන්නේ අපේ සාමාජිකයෝ වැඩි වෙද්දී. එකට නම් උබලට උදව් කරන්න පුළුවන්. පුලුවන්නම් කුහක නොවී අපේ link එක share කරන්න.

❇️ උබටත් පුළුවන් අපිත් එක්ක එකතු වෙලා admin කෙනෙක් විදිහට වැඩ කරන්න. ඒකට අපිව contact කරගන්න පුළුවන් යට තියෙන බොට්ගෙන්.</b>"""
    FILM_TXT = """♣️ 𝐌𝐨𝐯𝐢𝐞𝐬 & 𝐓𝐯 𝐒𝐞𝐫𝐢𝐞𝐬 ♣️
<b>
❇️ අපේ සේවා අතරින් ජනප්‍රියම සේවාව විදිහට මෙය හදුන්වන්න පුළුවන්. අපේ දත්ත ගබඩාවේ දැනට චිත්‍රපටි (Movies) 100,000ට ආසන්න ප්‍රමාණයකුත් රුපවාහිනී කතා මාලා (Tv series) 500කට ආසන්න ප්‍රමාණයකුත් දැනට ගබඩා කරලා තියෙනවා. 

❇️ මේ අතරින් ඔබට අවශ්‍ය චිත්‍රපටියේ (Movies) හෝ රුපවාහිනී කතා මාලාවේ (Tv series) නම ,වර්ෂය(year) සමගින් අපගේ ඉල්ලීම් ලබාගන්නා සමුහයට (Request Group) යැවීම මගින් ලබා ගත හැකියි. 

⭕️EX : joker 2019

❇️ වැඩිදුර විස්තර ලබාගැනීම සදහා "𝐑𝐞𝐚𝐝 𝐌𝐨𝐫𝐞..." බටනය ඔබන්න.එසේම "𝐅𝐫𝐞𝐪𝐮𝐞𝐧𝐭𝐥𝐲 𝐀𝐬𝐤𝐞𝐝 𝐐𝐮𝐞𝐬𝐭𝐢𝐨𝐧𝐬" බටනය මගින් බාගැනීමට(Download) අවශ්‍ය පිටපතක් data හා කාලය ඉතුරු කරගෙන සොයාගන්නා ආකාරය ගැන යම් දැනුමක් ලබාදේ. "New Release" channel එක හරහා අලුතින් නිකුත් වන චිත්‍රපටත් , "𝐒𝐢𝐧𝐡𝐚𝐥𝐚 𝐌𝐨𝐯𝐢𝐞" මගින් සිංහල චිත්‍රපටත්, "𝐒𝐢𝐧𝐡𝐚𝐥𝐚 𝐃𝐮𝐛𝐛𝐞𝐝 𝐌𝐨𝐯𝐢𝐞𝐬/ 𝐓𝐯 𝐒𝐞𝐫𝐢𝐞𝐬" මගින් සිංහල හඩකැවූ චිත්‍රපට හා රුපවාහිනී කතා මාලාත්, "𝐓𝐯 𝐒𝐞𝐫𝐢𝐞𝐬 𝐖𝐨𝐫𝐥𝐝" මගින් රුපවාහිනී කතා මාලා මෙන්ම "𝐌𝐨𝐯𝐢𝐞 𝐂𝐨𝐥𝐥𝐞𝐜𝐭𝐢𝐨𝐧𝐬" මගින් චිත්‍රපට එකතුත් ලබාගත හැකියි.­</b>"""
    SUBTITLES_TXT = """♣️ 𝐒𝐮𝐛𝐭𝐢𝐭𝐥𝐞𝐬 ♣️
<b>
❇️ චිත්‍රපට(Movies) සහ රුපවාහිනී කතා මාලා(Tv Series)  බලන විට බොහෝවිට වැදගත් අංගයක් බවට දැන් උපසිරැසි(Subtitles) පත්වෙලා තියෙනවා. සිංහල මෙන්ම ඉංග්‍රීසි උපසිරසිද(Subtitles) ලබාගැනීමට අපි සමුහයක් නිර්මාණය කර තිබෙනවා. ඒ හරහා ඔබට පහසුවෙන් උපසිරැසි(Subtitles) බාගැනීමේ(Download) හැකියාව ලැබෙනවා. 

❇️ මෙහි ඇත්තේ Opensubtitles, Baiscope , Zoomlk, Cineru, Piratelk වැනි වෙබ් අඩවිවලින් ලබාගත් උපසිරැසි වේ. හුදෙක්ම මෙය නිර්මාණය කර ඇත්තේ ඔබගේ පහසුව තකා පහසුවෙන් ඕනෑම දෙයක් බාගැනීම(Download) වෙනුවෙනි. එම නිසා මෙය අවභාවිතයෙන් වලකින්න.
පහතින් දැක්වෙන "𝐉𝐨𝐢𝐧 𝐍𝐨𝐰" බටනය(button) හරහා අපේ උපසිරැසි(Subtitles) සමුහය වෙත එකතු වන්න.</b>­"""
    LIBRARY_TXT = """♣️ 𝐓𝐡𝐞 𝐋𝐢𝐛𝐫𝐚𝐫𝐲 ♣️
<b>
❇️ මෙහිදී සිදු කරන්නේ ඔබට අවශ්‍ය කෘති  PDF ආකාරයට ලබාදීම. අදාල චැනලය(channel)  තුල නවකතා,කෙටිකතා,පරිවර්තන,අධ්‍යාපනික පොත් පත් ආදිය පල කරනවා. 

❇️ අප මේ තුලින් බොහෝ විට සිදු කරන්නේ පොත් හුවමාරුවකට අවශ්‍ය ස්ථානයක් සැපයීම. අපි මැදිහත්කරුවෝ පමණයි. ඔබට හැකියි ඔබ සතු කෘති pdf බවට පරිවර්තනය කොට අප වෙත @Slofficialcontactbot හරහා අප වෙත යොමු කරන්න. Pdf බවට පත් කරන ආකාරය පහත "CREATE PDF" බටනය හරහා කියවන්න.

❇️ ඔබට පොත් ඉල්ලීමක් කිරීමට අවශ්‍ය නම් @Slofficialcontactbot  හරහා අපව දැනුවත් කල හැකියි. (ඊට පෙර අප සමුහය හෝ channel එක තුල සොයා බලා ඉල්ලීම් කරන ලෙස ඉල්ලා සිටිනවා.) "𝐉𝐨𝐢𝐧 𝐍𝐨𝐰" බටනය(button) හරහා අපේ 𝐓𝐡𝐞 𝐋𝐢𝐛𝐫𝐚𝐫𝐲 channel හා එකතු වන්න.</b>­"""
    FIGHTCLUB_TXT = """♣️ 𝐓𝐡𝐞 𝐅𝐢𝐠𝐡𝐭 𝐂𝐥𝐮𝐛 ♣️
<b>
❇️ ඔයා WWE , UFC වගේ තරගවල රසිකයෙක්ද? ඒ වගේ fight නරඹන්න ආසද? තමන්ට කැමති වෙලාවක නරඹන්න හැකියාවක් නැද්ද? මෙන්න අපි ඒ වෙනුවෙන් විසදුමක් අරගෙන ඇවිත් තියෙනවා. 

❇️ WWE හා UFC තරග අපි මෙම channel එක වෙත උඩුගත කරනවා. ඔයාට පුළුවන් පහසුවෙන් ඒවා බාගත(Download) කරගෙන නරඹන්න. 
පහලින් ඇති "𝐉𝐨𝐢𝐧 𝐍𝐨𝐰" බටනය හරහා අපේ  The Fight Club චැනලය වෙත එකතු වෙන්න.</b>­"""
    APPSTORE_TXT = """♣️ 𝐌𝐨𝐝 𝐀𝐩𝐩 𝐒𝐭𝐨𝐫𝐞 ♣️
<b>
❇️ අපේ community එකේ තවත් සේවාවක් තමයි mod apps ලබාදීම. මුදල් ගෙවල ලබාගන්න අවශ්‍ය ගොඩක් app වල feature unlock කරලා මේ චැනලය වෙතට උඩුගත කරනවා. 

❇️ මේ මගින් මුදල් නොගෙවා භාවිතා කිරීමට නොහැකි බොහෝ  app පහසුවෙන් භාවිතා කිරීමේ හැකියාව ලැබෙනවා.  පහලින් ඇති "𝐉𝐨𝐢𝐧 𝐍𝐨𝐰" බටනය හරහා අපේ  Mod apps චැනලය වෙත එකතු වෙන්න.</b> ­"""
    SOFTWARE_TXT = """♣️ 𝐂𝐫𝐚𝐜𝐤𝐞𝐝 𝐒𝐨𝐟𝐭𝐰𝐚𝐫𝐞𝐬 ♣️
<b>
❇️ ඔයා පරිගණකයක් භාවිතා කරනවානම් දන්නවා ඇති ඔයා භාවිතා කරන ගොඩක් softwares මිල දී ගන්න ඕනි කියල මෙතන ඉන්න ගොඩක් අයට ඒ සදහා ආර්ථික හයියක් නැ. අපි මේ මගින් සිදු කරන්නේ ඔවුන්ට පහසුවෙන් ඒ softwares crack කර භාවිතා කර හැකි ලෙස සකස් කර ඇති files ලබා දෙන එක. ඔයාට ආර්ථික හයියක් ඒ සදහා තියෙනවනම් දෙවරක් ඒ ගැන කල්පනා කරන්න හොදේ.
ඒ සදහා "𝐉𝐨𝐢𝐧 𝐍𝐨𝐰" බටනය හරහා අදාල channel එක වෙත එකතු වෙන්න.­</b>"""
    PCGAMES_TXT = """♣️ 𝐏𝐂 𝐆𝐚𝐦𝐞𝐬 ♣️
<b>
❇️ ඔයා පරිගණකයක් භාවිතා කරනවානම් දන්නවා ඇති ඔයා භාවිතා කරන ගොඩක් games මිල දී ගන්න ඕනි කියල මෙතන ඉන්න ගොඩක් අයට ඒ සදහා ආර්ථික හයියක් නැ. අපි මේ මගින් සිදු කරන්නේ ඔවුන්ට පහසුවෙන් ඒ games repack කර භාවිතා කර හැකි ලෙස සකස් කර ඇති files ලබා දෙන එක. ඔයාට ආර්ථික හයියක් ඒ සදහා තියෙනවනම් දෙවරක් ඒ ගැන කල්පනා කරන්න හොදේ.
ඒ සදහා "𝐉𝐨𝐢𝐧 𝐍𝐨𝐰" බටනය හරහා අදාල channel එක වෙත එකතු වෙන්න.</b> ­"""
    DAILYNEWS_TXT = """♣️ 𝐃𝐚𝐢𝐥𝐲 𝐍𝐞𝐰𝐬𝐩𝐚𝐩𝐞𝐫𝐬 ♣️
<b>
❇️ දවස ගානේ පත්තරේ කියවන්න මෙන්න ඔයාට chance එකක්. අපි මේ channel එකට website එකක් ගානේ නොගිහින් එකෙන්ම පත්තර තොගයක් upload කරනවා. දවස ගානේ පත්තර කියවන්න කැමති නම් මේක තමා ඔයාලට ඕනි channel එක. දැන්ම "𝐉𝐨𝐢𝐧 𝐍𝐨𝐰" බටනය හරහා අදාල channel එකට එකතු වෙන්න.
🔰 දිවයින 
🔰 අරුණ
🔰 ලංකාදීප
🔰 The island
🔰 The morning</b>­"""
    LOG_TEXT_G = """#NewGroup
Group = {}(<code>{}</code>)
Total Members = <code>{}</code>
Added By - {}

<a href=https://t.me/slofficialmain> ‌‌‌‌©️ＳＬＯＦＦＩＣＩＡＬ ­</a> ­"""
    LOG_TEXT_P = """#NewUser
ID - <code>{}</code>
Name - {}

<a href=https://t.me/slofficialmain> ‌‌‌‌©️ＳＬＯＦＦＩＣＩＡＬ ­</a> ­"""
    WELCOME_TXT = """<b>ආයුබෝවන් {} 🙏🙏🙏
Slofficial community වෙතට ආදරයෙන්, සාදරයෙන් පිලිගන්නවා. 
ඔයා මේ එකතු වෙන්නේ ලංකාවේ තියෙන සුපිරිම All in one Telegram Community එක සමග. අපි කරන්නේ ඔයා සැර කට්ටටක් කාගෙන website ගානේ ad skip කර කර දගලන කාලේ අඩු කරලා හරිම පහසුවෙන් පහලින් තියෙන දේවල් ලබාගන්න උදව් කරන එක,
<i>
⚫️ Movies and Tv series
⚫️ Subtitles
⚫️ PDF Books
⚫️ The Fight Club (WWE / UFC Games)
⚫️ Mod Apps 
⚫️ Cracked Softwares
⚫️ Repacked Pc Games
⚫️ Daily Newspapers
⚫️ Free Internet Tricks (Ehi, Sks etc...)
⚫️ Memes
⚫️ Telegram Games
⚫️ Songs
⚫️ Comics</i>
වැඩි දුර විස්තර ලබාගැනීමට "𝐌𝐨𝐫𝐞 𝐈𝐧𝐟𝐨" බටනය ඔබන්න.

⚠️ Disclaimer :-
කරුණාකර අපගේ main channel එකට "𝐉𝐨𝐢𝐧 𝐍𝐨𝐰" බටනය හරහා එකතු වන්න.අපි මේ සිදු කරන බොහොමයක් දේවල් copyright ප්‍රශ්න ඇති විය හැකි දේවල් නිසා අපේ channel හෝ මේ group එක වුවත් නැති වුවහොත් ඒ වෙනුවෙන් ඔබව දැනුවත් කිරීමේ හැකියාව එවිට ලැබෙනවා. මේ හේතුව නිසා සමහර අවස්ථාවල ඔයාට අපේ විවිධ සේවා ලබාගැනීමේදී main channel වෙත join නොවීම නිසා විවිධ සිමා කිරීම් ඇති විය හැකියි.</b>"""
    FREEZONE_TXT = """♣️ 𝐅𝐫𝐞𝐞 𝐈𝐧𝐭𝐞𝐫𝐧𝐞𝐭 𝐓𝐫𝐢𝐜𝐤𝐬 ♣️
<b>
❇️ මාසෙටම එක පැකේජ් එකෙන් Free Internet යන්න ආසද? එහෙනම් අපේ 𝐅𝐫𝐞𝐞 𝐙𝐨𝐧𝐞 𝐛𝐲 𝐒𝐋 𝐎𝐟𝐟𝐢𝐜𝐢𝐚𝐥 Channel එකට Join වෙන්න.
🔰 Fims Download කරන්න,
🔰 Gamesගහන්න,
🔰 Zoom Use කරන්න; වගේ ගොඩක් දේවල් පුලුවන්

❇️Channel එකෙන් Free Internet යන්න අවශ්‍ය Ehi File, SKS file, HPI File, SSh Accounts ආදිය නොමිලේ ලබා ගන්න පුලුවන්. දැන්ම "𝐉𝐨𝐢𝐧 𝐍𝐨𝐰" බටනය හරහා අදාල channel එකට එකතු වෙන්න.</b> """
    MEME_TXT = """♣️ 𝐓𝐡𝐞 𝐌𝐞𝐦𝐞 𝐒𝐭𝐨𝐫𝐞 ♣️ 
<b>
❇️ කම්මැලි හිතිලා fb ගියාම ad ගොඩ අස්සේ meme බලන්න ගියාම එපා වෙනවනේ. ඔන්න ඔය හේතුව නිසා අපි meme වැටෙන්න වෙනම channel එකක් පටන් ගත්ත.  
🔰 Depress වෙලා නම් ඉන්නේ ඒ හේතු අමතක කරන්න. 
🔰 කේන්ති ගිහින් නම් නම් ඉන්නේ කේන්තිය පොඩ්ඩක් නිවා ගන්න.
🔰 පාඩම් කරන ගමන් ඔලුව නිදහස් කරගන්න.

❇️ දැන්ම ගිහින් අපේ 𝐌𝐞𝐦𝐞 𝐒𝐭𝐨𝐫𝐞 channel එකට "𝐉𝐨𝐢𝐧 𝐍𝐨𝐰" බටනය ඔබලා එකතු වෙන්න.</b>"""
    TGGAME_TXT = """♣️ 𝐓𝐞𝐥𝐞𝐠𝐫𝐚𝐦 𝐆𝐚𝐦𝐞𝐬 ♣️
<b>
❇️ Phone එකට වෙන වෙනම mini games දාගන්නැතුව telegram හරහාම mini games play කරන්න. ආතල් එකේ ඒ group ඉන්න යාලුවෝ අතරින් ඒ game එකේ වැඩිම ලකුණු අරගෙන අනිත් යාළුවන්ට අභියෝග කරන්න. games 50 කට වැඩියෙන්,
🔰 Depress වෙලා නම් ඉන්නේ ඒ හේතු අමතක කරන්න. 
🔰 කේන්ති ගිහින් නම් නම් ඉන්නේ කේන්තිය පොඩ්ඩක් නිවා ගන්න.
🔰 පාඩම් කරන ගමන් ඔලුව නිදහස් කරගන්න.

❇️ දැන්ම ගිහින් අපේ 𝐓𝐆 𝐆𝐚𝐦𝐞𝐬 group එකට "𝐉𝐨𝐢𝐧 𝐍𝐨𝐰" බටනය ඔබලා  එකතු වෙන්න.</b>"""
    MUSIC_TXT = """♣️ 𝐅𝐫𝐞𝐞𝐝𝐨𝐦 𝐌𝐮𝐬𝐢𝐜 ♣️
<b>
❇️ සින්දු හොයන්න website ගානේ දගලන්න වෙලාද? මෙන්න එකට විසදුම. 𝐅𝐫𝐞𝐞𝐝𝐨𝐦 𝐌𝐮𝐬𝐢𝐜 සින්දුවේ නම ගහල සින්දුව තත්පර ගානක් ඇතුලත ඔයාට අවශ්‍ය සුපිරිම quality වලින් ලබාගන්න. 
🔰 Depress වෙලා නම් ඉන්නේ ඒ හේතු අමතක කරන්න. 
🔰 කේන්ති ගිහින් නම් නම් ඉන්නේ කේන්තිය පොඩ්ඩක් නිවා ගන්න.
🔰 පාඩම් කරන ගමන් ඔලුව නිදහස් කරගන්න.

❇️ දැන්ම ගිහින් අපේ 𝐅𝐫𝐞𝐞𝐝𝐨𝐦 𝐌𝐮𝐬𝐢𝐜 group එකට "𝐉𝐨𝐢𝐧 𝐍𝐨𝐰" බටනය ඔබලා  එකතු වෙන්න.</b>"""
    COMICS_TXT = """♣️ 𝐓𝐡𝐞 𝐂𝐨𝐦𝐢𝐜 𝐊𝐢𝐧𝐠𝐝𝐨𝐦 ♣️
<b>
❇️ ඔයා comics කියව්මේ රසිකයෙක්ද? මේ තමයි ඔයා හොයන channel එක. අපි ලෝකේ ජනප්‍රිය වෙලා තියෙන comics ගොඩක් මේ channel එකට උඩුගත කරනවා. ඔයාට පුළුවන්,
🔰 Dc comics
🔰 Marvel comics වගේම ලෝකෙම ජනප්‍රිය වුනු comics බොහොමයක් ලබාගන්න.

❇️ දැන්ම එකතු වන්න අපේ 𝐓𝐡𝐞 𝐂𝐨𝐦𝐢𝐜 𝐊𝐢𝐧𝐠𝐝𝐨𝐦 channel එකට.</b>"""
